## Plan Result (543: ithc_frontdoor - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.premium_front_door.azapi_update_resource.frontdoor_system_identity
* Replace
  * module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
  * module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity will be updated in-place
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
      ~ body                    = jsonencode(
          ~ {
              ~ identity = {
                  ~ type = "None" -> "SystemAssigned"
                }
            }
        )
        id                      = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc"
        name                    = "sdshmcts-ithc"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "frontdoor_premium_kv_access" {
      ~ id                      = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/sds-platform-ithc-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsithc/objectId/06e416f2-3afe-40af-ab88-2818d0048b5f" -> (known after apply)
      ~ object_id               = "06e416f2-3afe-40af-ab88-2818d0048b5f" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "frontdoor_premium_kv_access" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/sds-platform-ithc-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsithc/providers/Microsoft.Authorization/roleAssignments/9d681303-c8f8-d1c1-fd29-7cd4afac3138" -> (known after apply)
      ~ name                                   = "9d681303-c8f8-d1c1-fd29-7cd4afac3138" -> (known after apply)
      ~ principal_id                           = "06e416f2-3afe-40af-ab88-2818d0048b5f" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity has changed
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
        id                      = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc"
        name                    = "sdshmcts-ithc"
      ~ output                  = jsonencode(
          ~ {
              - identity = {
                  - principalId = "06e416f2-3afe-40af-ab88-2818d0048b5f"
                  - tenantId    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                }
            }
        )
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



## :warning: Errors

* add a label 543: ithc_frontdoor - TerraformPlanApply/destroy: POST https://api.github.com/repos/hmcts/sds-azure-platform/issues/486/labels: 422 Validation Failed. Issues cannot have more than 100 labels [{Resource:Label Field:labels Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":486,"Program":"tfcmt","SHA1":"","Target":"543: ithc_frontdoor - TerraformPlanApply","Vars":{}} -->